# IFC_DMSetFieldType

## Description
Sets indicated field type from current IFC Data Mapping.

```pascal
FUNCTION IFC_DMSetFieldType(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				inStrFieldName : STRING;
				type           : INTEGER) : BOOLEAN;
```

```python

def vs.IFC_DMSetFieldType(inStrObjName, inStrEntryName, inStrFieldName, type):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|inStrEntryName|STRING||
|inStrFieldName|STRING||
|type|INTEGER||

## Version
Availability: from Vectorworks 2017
## Category
* IFC